# Taps
tap 'homebrew/cask-fonts'
tap 'macvim-dev/macvim'
# tap 'caskroom/versions'

# Install ZSH and plugins/themes
brew 'zsh'

# Install Binaries
brew 'awscli'
brew 'awsebcli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'node'
brew 'yarn'
brew 'trash'
brew 'python'
brew 'macvim'
brew 'fzf'
brew 'the_silver_searcher'

# Development
brew 'highlight'


# Apps
cask 'arq'
cask 'alfred'
cask 'iterm2'
cask 'visual-studio-code'
cask 'slack'
cask 'spectacle'
cask 'firefox'
cask 'google-chrome'
cask 'vlc'
cask 'timing'
cask '1password'
cask '1password-cli'
cask 'amazon-chime'
cask 'spotify'
cask 'docker'
cask 'dwarf-fortress'
cask 'gitkraken'
cask 'google-hangouts'
cask 'goland'
cask 'pycharm'
cask 'tiles'
cask 'timeout'
cask 'zoom'

# Fonts
cask 'font-hack-nerd-font'
